In [3]:
#GROUPYBY

In [4]:
import pandas as pd

In [5]:
#create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person': ['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}

In [6]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [7]:
df = pd.DataFrame(data)

In [8]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [9]:
df.groupby('Company') #.groupby() method to group rows tgtr based off a column name

In [10]:
by_comp= df.groupby("Company")

In [11]:
by_comp

In [12]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [16]:
by_comp.mean(numeric_only = True) #cant just write mean directly because data has objects and we need mean of numeric only

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [17]:
df.dtypes

Company    object
Person     object
Sales       int64
dtype: object

In [23]:
by_comp['Sales'].mean() #this is represented in series

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [24]:
by_comp[['Sales']].mean() #this is dataframe

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [25]:
by_comp.std

In [27]:
by_comp[['Sales']].std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [28]:
by_comp[['Sales','Person']].min() #for minimum value

         Sales   Person
Company
FB         243     Carl
GOOG       120  Charlie
MSFT       124      Amy

In [29]:
by_comp[['Sales']].max()

         Sales
Company
FB         350
GOOG       200
MSFT       340

In [30]:
by_comp[['Sales','Person']].max()

         Sales   Person
Company
FB         350    Sarah
GOOG       200      Sam
MSFT       340  Vanessa

In [32]:
df.loc[by_comp['Sales'].idxmax()]

  Company Person  Sales
5      FB  Sarah    350
0    GOOG    Sam    200
2    MSFT    Amy    340

In [33]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [35]:
df.count()

Company    6
Person     6
Sales      6
dtype: int64

In [36]:
by_comp.describe()
#gives statistical description of all the numeric columns inside a df

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [37]:
df.describe()

            Sales
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000

In [38]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [39]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

# 03-11-2025

# OPERATIONS

In [1]:
import pandas as pd

In [34]:
df = pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10,11],'col2':[444,555,666,444,333,777,111,222,888,999,333],'col3':['abc','def','ghi','xyz','asx','wes','ert','uyuu','kik','dfg','tyg']})

In [35]:
df

    col1  col2  col3
0      1   444   abc
1      2   555   def
2      3   666   ghi
3      4   444   xyz
4      5   333   asx
5      6   777   wes
6      7   111   ert
7      8   222  uyuu
8      9   888   kik
9     10   999   dfg
10    11   333   tyg

In [36]:
df.head() #this operation is for printing the top 5 values of your dataframe.

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz
4     5   333  asx

In [37]:
df.tail() #this operation is for printing the bottom 5 values of your dataframe.

    col1  col2  col3
6      7   111   ert
7      8   222  uyuu
8      9   888   kik
9     10   999   dfg
10    11   333   tyg

In [38]:
df.head(3) # this is for printing desired number of values by assigning a number, top 3

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi

In [39]:
df.tail(2) #this is for printing desired bottom level values, bottom 2

    col1  col2 col3
9     10   999  dfg
10    11   333  tyg

# INFO ON UNIQUE VALUES

In [40]:
df['col2'].unique() #printed set of all unique values present in df

array([444, 555, 666, 333, 777, 111, 222, 888, 999])

In [41]:
df['col1'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11])

In [42]:
df['col3'].unique()

array(['abc', 'def', 'ghi', 'xyz', 'asx', 'wes', 'ert', 'uyuu', 'kik',
       'dfg', 'tyg'], dtype=object)

In [43]:
df['col2'].nunique() #helps in counting number of unique values in dataframe

9

In [44]:
df['col2'].value_counts

<bound method IndexOpsMixin.value_counts of 0     444
1     555
2     666
3     444
4     333
5     777
6     111
7     222
8     888
9     999
10    333
Name: col2, dtype: int64>

# SELECTING DATA

In [45]:
newdf = df['col1']>2 #applying conditions here

In [46]:
newdf

0     False
1     False
2      True
3      True
4      True
5      True
6      True
7      True
8      True
9      True
10     True
Name: col1, dtype: bool

In [47]:
newdf = df['col2']==444 #will return true for all values it satisfies the condition of

In [48]:
newdf

0      True
1     False
2     False
3      True
4     False
5     False
6     False
7     False
8     False
9     False
10    False
Name: col2, dtype: bool

In [49]:
newdf = df[(df['col1']>2) & (df['col2']==444)] #combining both using and operator

In [50]:
newdf

   col1  col2 col3
3     4   444  xyz

In [51]:
# APPLYING FUNCTIONS

In [52]:
def times2(x):
    return x*2

In [53]:
df['col1'].apply(times2) #we use apply to assign columns to others and apply method fns

0      2
1      4
2      6
3      8
4     10
5     12
6     14
7     16
8     18
9     20
10    22
Name: col1, dtype: int64

In [54]:
df['col3'].apply(len) #prints length of each string present in col3

0     3
1     3
2     3
3     3
4     3
5     3
6     3
7     4
8     3
9     3
10    3
Name: col3, dtype: int64